### Getting Financial Data - Pandas Datareader
* [AlphaVantage API 키 받기](https://www.alphavantage.co/support/#api-key)
* [datareader docs 보기](https://pandas-datareader.readthedocs.io/en/latest/)

In [2]:
import pandas as pd
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt
import pandas_datareader as pdr

%matplotlib inline

In [3]:
# 시작이 1/01/2015 끝이 오늘(오늘이 언제든)이 되는 datetime 데이터 만들기
start_d = '2015-01-01'
end_d = pd.Timestamp.today().date()

date_s = pd.date_range(start_d, end_d)
date_s

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2024-05-31', '2024-06-01', '2024-06-02', '2024-06-03',
               '2024-06-04', '2024-06-05', '2024-06-06', '2024-06-07',
               '2024-06-08', '2024-06-09'],
              dtype='datetime64[ns]', length=3448, freq='D')

In [4]:
personal_api = ''

In [10]:
# pandas_datareader 이용해서 지정한 기간 동안의 애플 주가(AAPL)를 불러와서 df_apple로 지정하고 뽑기

# class pandas_datareader.av.time_series.AVTimeSeriesReader(symbols=None, function='TIME_SERIES_DAILY', 
#                                                           start=None, end=None, retry_count=3, pause=0.1,
#                                                           session=None, chunksize=25, api_key=None)
# Returns DataFrame of the Alpha Vantage Stock Time Series endpoints

df_apple = pdr.av.time_series.AVTimeSeriesReader(symbols='AAPL', function='TIME_SERIES_DAILY', start=start_d, end=end_d, api_key=personal_api).read()
print(df_apple.shape)
df_apple.head()

(2374, 5)

              open    high      low   close    volume
2015-01-02  111.39  111.44  107.350  109.33  53204626
2015-01-05  108.29  108.65  105.410  106.25  64285491
2015-01-06  106.54  107.43  104.630  106.26  65797116
2015-01-07  107.20  108.20  106.695  107.75  40105934
2015-01-08  109.23  112.15  108.700  111.89  59364547

In [13]:
# stock 이라는 이름의 열을 추가하고 심볼인 AAPL을 넣기
df_apple['stock'] = 'AAPL'
df_apple.head()

              open    high      low   close    volume stock
2015-01-02  111.39  111.44  107.350  109.33  53204626  AAPL
2015-01-05  108.29  108.65  105.410  106.25  64285491  AAPL
2015-01-06  106.54  107.43  104.630  106.26  65797116  AAPL
2015-01-07  107.20  108.20  106.695  107.75  40105934  AAPL
2015-01-08  109.23  112.15  108.700  111.89  59364547  AAPL

In [14]:
# 같은 방식으로 Tesla(TSLA), IBM(IBM), Microsoft(MSFT)의 주가를 불러오기
df_tesla = pdr.av.time_series.AVTimeSeriesReader(symbols='TSLA', function='TIME_SERIES_DAILY', start=start_d, end=end_d, api_key=personal_api).read()
df_ibm = pdr.av.time_series.AVTimeSeriesReader(symbols='IBM', function='TIME_SERIES_DAILY', start=start_d, end=end_d, api_key=personal_api).read()
df_microsoft = pdr.av.time_series.AVTimeSeriesReader(symbols='MSFT', function='TIME_SERIES_DAILY', start=start_d, end=end_d, api_key=personal_api).read()
df_tesla['stock'] = 'TSLA'
df_ibm['stock'] = 'IBM'
df_microsoft['stock'] = 'MSFT'

print('df_tesla')
print(df_tesla.shape)
display(df_tesla.head())
print('-'*50)

print('df_ibm')
print(df_ibm.shape)
display(df_ibm.head())
print('-'*50)

print('df_microsoft')
print(df_microsoft.shape)
display(df_microsoft.head())
print('-'*50)

df_tesla
(2374, 6)

              open      high       low    close   volume stock
2015-01-02  222.87  223.2500  213.2600  219.310  4764443  TSLA
2015-01-05  214.55  216.5000  207.1626  210.090  5368477  TSLA
2015-01-06  210.06  214.2000  204.2100  211.280  6261936  TSLA
2015-01-07  213.35  214.7800  209.7800  210.950  2968390  TSLA
2015-01-08  212.81  213.7999  210.0100  210.615  3442509  TSLA

--------------------------------------------------
df_ibm
(2374, 6)

              open     high     low   close   volume stock
2015-01-02  161.31  163.310  161.00  162.06  5525341   IBM
2015-01-05  161.27  161.270  159.19  159.51  4880389   IBM
2015-01-06  159.67  159.960  155.17  156.07  6145670   IBM
2015-01-07  157.20  157.200  154.03  155.05  4701015   IBM
2015-01-08  156.24  159.044  155.55  158.42  4240585   IBM

--------------------------------------------------
df_microsoft
(2374, 6)

             open     high    low   close    volume stock
2015-01-02  46.66  47.4200  46.54  46.760  27913852  MSFT
2015-01-05  46.37  46.7300  46.25  46.325  39673865  MSFT
2015-01-06  46.38  46.7490  45.54  45.650  36447854  MSFT
2015-01-07  45.98  46.4600  45.49  46.230  29114061  MSFT
2015-01-08  46.75  47.7499  46.72  47.590  29645202  MSFT

--------------------------------------------------

In [80]:
# 4개의 df를 하나로 합치기
df_four = pd.concat([df_apple, df_tesla, df_ibm, df_microsoft])
print(df_four.shape)
display(df_four.head())
df_four.tail()

(9496, 6)

              open    high      low   close    volume stock
2015-01-02  111.39  111.44  107.350  109.33  53204626  AAPL
2015-01-05  108.29  108.65  105.410  106.25  64285491  AAPL
2015-01-06  106.54  107.43  104.630  106.26  65797116  AAPL
2015-01-07  107.20  108.20  106.695  107.75  40105934  AAPL
2015-01-08  109.23  112.15  108.700  111.89  59364547  AAPL

               open    high       low   close    volume stock
2024-06-03  415.525  416.43  408.9234  413.52  17484675  MSFT
2024-06-04  412.430  416.44  409.6750  416.07  14348917  MSFT
2024-06-05  417.810  424.08  416.3000  424.01  16988038  MSFT
2024-06-06  424.010  425.31  420.5800  424.52  14861251  MSFT
2024-06-07  426.200  426.28  423.0000  423.85  13621650  MSFT

In [81]:
# stock 열을 멀티인덱스로 지정하기
df_four.set_index([df_four.index, 'stock'], inplace=True)
df_four

                     open    high       low   close    volume
           stock
2015-01-02 AAPL   111.390  111.44  107.3500  109.33  53204626
2015-01-05 AAPL   108.290  108.65  105.4100  106.25  64285491
2015-01-06 AAPL   106.540  107.43  104.6300  106.26  65797116
2015-01-07 AAPL   107.200  108.20  106.6950  107.75  40105934
2015-01-08 AAPL   109.230  112.15  108.7000  111.89  59364547
...                   ...     ...       ...     ...       ...
2024-06-03 MSFT   415.525  416.43  408.9234  413.52  17484675
2024-06-04 MSFT   412.430  416.44  409.6750  416.07  14348917
2024-06-05 MSFT   417.810  424.08  416.3000  424.01  16988038
2024-06-06 MSFT   424.010  425.31  420.5800  424.52  14861251
2024-06-07 MSFT   426.200  426.28  423.0000  423.85  13621650

[9496 rows x 5 columns]

In [92]:
# 날짜 형식인 0번째 index가 datetime 형식이 아님을 확인하고, pd.to_datetime() 적용하기
# object(string) 형식
print(df_four.index.levels[0])
# 바꿀 형식인 datetime
print(pd.to_datetime(df_four.index.levels[0]))

# 바꾼 형식으로 지정
df_four.index = df_four.index.set_levels([pd.to_datetime(df_four.index.levels[0]), df_four.index.levels[1]])
df_four

DatetimeIndex(['2015-01-02', '2015-01-05', '2015-01-06', '2015-01-07',
               '2015-01-08', '2015-01-09', '2015-01-12', '2015-01-13',
               '2015-01-14', '2015-01-15',
               ...
               '2024-05-24', '2024-05-28', '2024-05-29', '2024-05-30',
               '2024-05-31', '2024-06-03', '2024-06-04', '2024-06-05',
               '2024-06-06', '2024-06-07'],
              dtype='datetime64[ns]', length=2374, freq=None)
DatetimeIndex(['2015-01-02', '2015-01-05', '2015-01-06', '2015-01-07',
               '2015-01-08', '2015-01-09', '2015-01-12', '2015-01-13',
               '2015-01-14', '2015-01-15',
               ...
               '2024-05-24', '2024-05-28', '2024-05-29', '2024-05-30',
               '2024-05-31', '2024-06-03', '2024-06-04', '2024-06-05',
               '2024-06-06', '2024-06-07'],
              dtype='datetime64[ns]', length=2374, freq=None)

                     open    high       low   close    volume
           stock
2015-01-02 AAPL   111.390  111.44  107.3500  109.33  53204626
2015-01-05 AAPL   108.290  108.65  105.4100  106.25  64285491
2015-01-06 AAPL   106.540  107.43  104.6300  106.26  65797116
2015-01-07 AAPL   107.200  108.20  106.6950  107.75  40105934
2015-01-08 AAPL   109.230  112.15  108.7000  111.89  59364547
...                   ...     ...       ...     ...       ...
2024-06-03 MSFT   415.525  416.43  408.9234  413.52  17484675
2024-06-04 MSFT   412.430  416.44  409.6750  416.07  14348917
2024-06-05 MSFT   417.810  424.08  416.3000  424.01  16988038
2024-06-06 MSFT   424.010  425.31  420.5800  424.52  14861251
2024-06-07 MSFT   426.200  426.28  423.0000  423.85  13621650

[9496 rows x 5 columns]

In [93]:
# volume 정보만 갖고 있는 df_vol df 만들기
df_vol = df_four[['volume']]
df_vol

                    volume
           stock
2015-01-02 AAPL   53204626
2015-01-05 AAPL   64285491
2015-01-06 AAPL   65797116
2015-01-07 AAPL   40105934
2015-01-08 AAPL   59364547
...                    ...
2024-06-03 MSFT   17484675
2024-06-04 MSFT   14348917
2024-06-05 MSFT   16988038
2024-06-06 MSFT   14861251
2024-06-07 MSFT   13621650

[9496 rows x 1 columns]

In [140]:
# df_vol를 주간 단위, 기업별로 집계하기
    # stock 인덱스를 기준으로 그룹핑
    # resample 은 WEEKLY 주간으로 0번째 인덱스인 날짜를 기준으로
    # 집계이니 sum
    # stock 행을 보기 좋게 열로 올리기 unstack
df_vol.groupby('stock').resample('W', level=0).sum().unstack('stock')

               volume
stock            AAPL       IBM       MSFT       TSLA
2015-01-04   53204626   5525341   27913852    4764443
2015-01-11  282868187  24440360  158596624   22622034
2015-01-18  304226647  23272056  157088136   30799137
2015-01-25  198737041  31230797  137352632   16215501
2015-02-01  465842684  32927307  437786778   15720217
...               ...       ...        ...        ...
2024-05-12  300674993  17421523   76899183  377983065
2024-05-19  288966571  15933303   85671354  370347383
2024-05-26  208652122  18410125   84866064  402867388
2024-06-02  230454285  15594186  107655251  259618626
2024-06-09  245994434  14102396   77304531  312710972

[493 rows x 4 columns]

In [148]:
# 2015년도의 총 volume 확인하기
df_vol.groupby('stock').resample('YE', level=0).sum().unstack('stock').loc[['2015-12-31']]

                 volume
stock              AAPL         IBM        MSFT        TSLA
2015-12-31  13064316775  1105545521  9057582311  1086708380